[
  {
    "titolo": "Haier 30%",
    "codice": "VODAFONE-s6tmyh",
    "descrizione": "30% di sconto extra su elettrodomestici selezionati, anche su quelli gia' in offerta!",
    "scadenza": "31/12/2025"
  },
  {
    "titolo": "Piquadro.com 20%",
    "codice": "VODAPQ25",
    "descrizione": "Sconto del 20% su Piquadro.com.",
    "scadenza": "15/07/2025"
  },
  {
    "titolo": "Buono Regalo 5€",
    "codice": "REGALO5",
    "descrizione": "Ricevi un buono regalo da 5€.",
    "scadenza": "15/08/2024"
  },
  {
    "titolo": "Promo Estate",
    "codice": "ESTATE24",
    "descrizione": "Offerte speciali per l'estate.",
    "scadenza": "31/07/2024"
  },
  {
    "titolo": "Cashback 20%",
    "codice": "CASH20",
    "descrizione": "Ottieni il 20% di cashback sui tuoi acquisti.",
    "scadenza": "10/10/2024"
  },
  {
    "titolo": "6€ di sconto Libraccio.it",
    "codice": "K8WNU57X",
    "descrizione": "Il Codice sconto è valido per una spesa minima di 45 €. Non è utilizzabile nei negozi Libraccio, non è cumulabile con altri codici sconto ma è cumulabile con altre eventuali promozioni. Non è utilizzabile sui testi ",
    "scadenza": "30/09/2025"
  },
{
    "titolo": "Offerta Lampo",
    "codice": "LAMPO24",
    "descrizione": "Offerta valida solo per poche ore!",
    "scadenza": "05/07/2024"
  },
  {
    "titolo": "7€ di sconto sullo store online Caffè Borbone",
    "codice": "S375P5VNRXLS",
    "descrizione": "Lo sconto si applica su una spesa minima di 30€(al netto delle eventuali spese di spedizione)",
    "scadenza": "30/09/2025"
  },
  {
    "titolo": "Sconto del 40% sulla stampa delle foto con PhotoSì",
    "codice": "9D1BA164",
    "descrizione": "Sconto valido su una spesa minima di 25€, spese di spedizione escluse",
    "scadenza": "30/09/2025"
  },
 {
    "titolo": "Burger King - Sconto di 5€ su una spesa minima di 10€",
    "codice": "3TI3J2",
    "descrizione": "Il codice promozionale non è cumulabile con altre eventuali promozioni in corso ed è utilizzabile solo su App Burger King Italia",
    "scadenza": "30/11/2025"
  },
{
    "titolo": "Fino a 400€ di sconto sui prodotti Braun",
    "codice": "SZMF1G9X4K7H",
    "descrizione": " Offerta valida solo su: https://it.braun.com/it-it/promotions/exclusivepartnership",
    "scadenza": "31/10/2025"
  },
{
    "titolo": "15€ di sconto su Camicissima",
    "codice": "404DD1AW3",
    "descrizione": "Il codice sconto è applicato sul valore totale dello scontrino di importo pari almeno a 70€. Il codice sconto non è cumulabile con altri voucher in corso. Il codice sconto non è utilizzabile per l’acquisto di GiftCard Camicissima o di altri partner. Il codice sconto è valido solo sui prodotti non in saldo. Il codice è utilizzabile una sola volta e lo sconto non è frazionabile. Le spese di spedizione non concorrono al raggiungimento della soglia minima di spesa.",
    "scadenza": "24/11/2025"
  },
{
    "titolo": "Sconti fino al 40% su una selezione di elettrodomestici per casa e cucina Panasonic",
    "codice": "VH-X0BV1L",
    "descrizione": "Questa promozione è valida solo per il Panasonic Online Store in Italia e non può essere riscattata presso altri rivenditori. La promozione è valida per un singolo acquisto solo per i prodotti mostrati nella pagina https://store.eu.panasonic.com/it-it/VodafoneHappy. Questa promozione è valida solo dal 17.10.2025 al 31.10.2025. Il codice sconto non è cumulabile con altre offerte promozionali o con prodotti già scontati. Non è possibile applicare lo sconto su acquisti già effettuati. Il prezzo scontato verrà visualizzato non appena il codice coupon verrà inserito nel campo corrispondente durante il processo di checkout nel Panasonic Online Store.",
    "scadenza": "31/10/2025"
  },
{
    "titolo": "12 mesi di abbonamento Telepass Sempre gratis e 100€ sui pedaggi",
    "codice": "HAPPYPED054715",
    "descrizione": "valida per chi non sia risultato cliente Telepass Base nei 30 giorni antecedenti l’adesione e che dal 8.9.25 al 9.11.25 aderisce al pacchetto Telepass Sempre (composto dal Contratto Telepass Base e Contratto Servizi di Mobilità) tramite i canali Vodafone: tali clienti avranno diritto a 12 mesi di canone gratuito del Pacchetto Telepass Sempre (poi 3,90€/mese con promo bundle). ",
    "scadenza": "09/11/2025"
  }
]
